function centroids = computeCentroids(X, idx, K)
%COMPUTECENTROIDS РІРѕР·РІСЂР°С‰Р°РµС‚ РЅРѕРІС‹Рµ С†РµРЅС‚СЂРѕРёРґС‹ РєР°Рє СЃСЂРµРґРЅРµРµ Р·РЅР°С‡РµРЅРёРµ С‚РѕС‡РµРє, РїСЂРёРїРёСЃР°РЅРЅС‹С… Рє РЅРёРј


% РџРѕР»РµР·РЅС‹Рµ РїРµСЂРµРјРµРЅРЅС‹Рµ
[m n] = size(X);

% Р’С‹ РґРѕР»Р¶РЅС‹ РІРµСЂРЅСѓС‚СЊ РєРѕСЂСЂРµРєС‚РЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ СЃР»РµРґСѓСЋС‰РёС… РїРµСЂРµРјРµРЅРЅС‹С…
centroids = zeros(K, n);


% ====================== РќРђР§РђР›Рћ Р’РђРЁР•Р“Рћ РљРћР”Рђ ======================
% РРЅСЃС‚СЂСѓРєС†РёРё: Р”Р»СЏ РєР°Р¶РґРѕРіРѕ С†РµРЅС‚СЂРѕРёРґР° РІС‹С‡РёСЃР»РёС‚Рµ СЃСЂРµРґРЅРµРµ Р·РЅР°С‡РµРЅРёРµ РѕС‚ РІСЃРµС… С‚РѕС‡РµРє, РѕС‚РЅРµСЃРµРЅРЅС‹С… Рє РЅРµРјСѓ
%               Р‘РѕР»РµРµ РєРѕРЅРєСЂРµС‚РЅРѕ, РІРµРєС‚РѕСЂ СЃС‚РѕР»Р±РµС† centroids(i, :)
%               РґРѕР»Р¶РµРЅ СЃРѕРґРµСЂР¶Р°С‚СЊ СЃСЂРµРґРЅРёРµ Р·РЅР°С‡РµРЅРёСЏ РїСЂРёРјРµСЂРѕРј РІС‹Р±РѕСЂРєРё X, РѕС‚РЅРµСЃРµРЅРЅС‹С… Рє i-РјСѓ С†РµРЅС‚СЂРѕРёРґСѓ
%
% Р—Р°РјРµС‡Р°РЅРёРµ: Р’С‹ РјРѕР¶РµС‚Рµ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ С†РёРєР» for
%

for i=1:K
    points = X(idx == i, :);
    centroid = mean(points);
    centroids(i, :) = centroid;
end

% ====================== РљРћРќР•Р¦ Р’РђРЁР•Р“Рћ РљРћР”Рђ ======================


end

