function idx = findClosestCentroids(X, centroids)
%FINDCLOSESTCENTROIDS РІС‹С‡РёСЃР»СЏРµС‚, Рє РєР°РєРѕРјСѓ С†РµРЅС‚СЂРѕРёРґСѓ РѕС‚РЅРѕСЃРёС‚СЃСЏ РєР°Р¶РґС‹Р№ РїСЂРёРјРµСЂ РёР· X
%

% РЈСЃС‚Р°РЅР°РІР»РёРІР°РµРј K
K = size(centroids, 1);

% Р’С‹ РґРѕР»Р¶РЅС‹ РІРµСЂРЅСѓС‚СЊ РєРѕСЂСЂРµРєС‚РЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ СЃР»РµРґСѓСЋС‰РёС… РїРµСЂРµРјРµРЅРЅС‹С…
idx = zeros(size(X,1), 1);

% ====================== РќРђР§РђР›Рћ Р’РђРЁР•Р“Рћ РљРћР”Рђ ======================
% РРЅСЃС‚СЂСѓРєС†РёРё: Р”Р»СЏ РєР°Р¶РґРѕРіРѕ РїСЂРёРјРµСЂР° РёР· X РѕРїСЂРµРґРµР»РёС‚Рµ Р±Р»РёР¶Р°Р№С€РёР№ Рє РЅРµРјСѓ С†РµРЅС‚СЂРѕРёРґ Рё СЃРѕС…СЂР°РЅРёС‚Рµ РµРіРѕ (С†РµРЅС‚СЂРѕРёРґР°) РёРЅРґРµРєСЃ
%               РІ РјР°СЃСЃРёРІРµ idx.
%               Р‘РѕР»РµРµ РєРѕРЅРєСЂРµС‚РЅРѕ, idx(i) РґРѕР»Р¶РµРЅ СЃРѕРґРµСЂР¶Р°С‚СЊ РёРЅРґРµРєСЃ С†РµС‚СЂРѕРёРґР°, Р±Р»РёР¶Р°Р№С€РµРіРѕ Рє i-РјСѓ РїСЂРёРјРµСЂСѓ,
%               С‚.Рµ. СЌС‚Рѕ РґРѕР»Р¶РЅРѕ Р±С‹С‚СЊ С‡РёСЃР»Рѕ РІ РґРёР°РїР°Р·РѕРЅРµ РѕС‚ 1 РґРѕ K

%
% Р—Р°РјРµС‡Р°РЅРёРµ: Р’С‹ РјРѕР¶РµС‚Рµ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ С†РёРєР» for
%

for i = 1:size(X,1)
    d = sqrt(sum((X(i,:) - centroids).^2, 2));
    [_, idx(i)] = min(d);
end

% ====================== РќРђР§РђР›Рћ Р’РђРЁР•Р“Рћ РљРћР”Рђ ======================

end

