function centroids = kMeansInitCentroids(X, K)
%KMEANSINITCENTROIDS РёРЅРёС†РёР°Р»РёР·РёСЂСѓРµС‚  K С†РµРЅС‚СЂРѕРёРґРѕРІ, РїСЂРёСЂР°РІРЅРёРІР°СЏ РёРј K СЃР»СѓС‡Р°Р№РЅС‹С… РїСЂРёРјРµСЂРѕРІ РёР· РІС‹Р±РѕСЂРєРё
%

% Р’С‹ РґРѕР»Р¶РЅС‹ РІРµСЂРЅСѓС‚СЊ РєРѕСЂСЂРµРєС‚РЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ СЃР»РµРґСѓСЋС‰РёС… РїРµСЂРµРјРµРЅРЅС‹С…
centroids = zeros(K, size(X, 2));

% ====================== РќРђР§РђР›Рћ Р’РђРЁР•Р“Рћ РљРћР”Рђ ======================
% РРЅСЃС‚СЂСѓРєС†РёРё: Р’С‹ РґРѕР»Р¶РЅС‹ РїСЂРёСЃРІРѕРёС‚СЊ С†РµРЅС‚СЂРѕРёРґР°Рј K СЃР»СѓС‡Р°Р№РЅС‹С… РїСЂРёРјРµСЂРѕРІ (Р±РµР· РїРѕРІС‚РѕСЂРѕРІ) РёР· РІС‹Р±РѕСЂРєРё X
%


randidx = randperm(size(X, 1));
centroids = X(randidx(1:K), :);



% ====================== РќРђР§РђР›Рћ Р’РђРЁР•Р“Рћ РљРћР”Рђ ======================

end

