function p = predict(Theta1, Theta2, X)
%PREDICT Прогнозирует значения классов входных данных с помощью обученной
%   нейронной сети

% Инициализация полезных переменных
m = size(X, 1);
num_labels = size(Theta2, 1);

% Вы должны вернуть корректные значения следующих переменных
p = zeros(size(X, 1), 1);

% ====================== НАЧАЛО ВАШЕГО КОДА ======================
% Подсказка: Почитайте документацию к функции max. Она позволяет искать
%       максимальные значения как по строкам, так и по столбцам матрицы.
%

X = [ones(m, 1) X];
z2 = X * Theta1';
a2 = sigmoid(z2);
a2 = [ones(size(a2, 1), 1) a2];
z3 = a2 * Theta2';
a3 = sigmoid(z3);
[_, p] = max(a3, [], 2);

% ====================== КОНЕЦ ВАШЕГО КОДА ======================


end
